MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19196/mcu.h
// Register: LATH
#define LATH LATH
extern volatile unsigned char           LATH                __at(0xC91);
#ifndef _LIB_BUILD
asm("LATH equ 0C91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATH0                  :1;
        unsigned LATH1                  :1;
        unsigned LATH2                  :1;
        unsigned LATH3                  :1;
    };
} LATHbits_t;
extern volatile LATHbits_t LATHbits __at(0xC91);
// bitfield macros
#define _LATH_LATH0_POSN                                    0x0
#define _LATH_LATH0_POSITION                                0x0
#define _LATH_LATH0_SIZE                                    0x1
#define _LATH_LATH0_LENGTH                                  0x1
#define _LATH_LATH0_MASK                                    0x1
#define _LATH_LATH1_POSN                                    0x1
#define _LATH_LATH1_POSITION                                0x1
#define _LATH_LATH1_SIZE                                    0x1
#define _LATH_LATH1_LENGTH                                  0x1
#define _LATH_LATH1_MASK                                    0x2
#define _LATH_LATH2_POSN                                    0x2
#define _LATH_LATH2_POSITION                                0x2
#define _LATH_LATH2_SIZE                                    0x1
#define _LATH_LATH2_LENGTH                                  0x1
#define _LATH_LATH2_MASK                                    0x4
#define _LATH_LATH3_POSN                                    0x3
#define _LATH_LATH3_POSITION                                0x3
#define _LATH_LATH3_SIZE                                    0x1
#define _LATH_LATH3_LENGTH                                  0x1
#define _LATH_LATH3_MASK                                    0x8

// Register: VB0GPR
#define VB0GPR VB0GPR
extern volatile unsigned char           VB0GPR              __at(0xE8C);
#ifndef _LIB_BUILD
asm("VB0GPR equ 0E8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VB0GPR                 :8;
    };
    struct {
        unsigned VB0GPR0                :1;
        unsigned VB0GPR1                :1;
        unsigned VB0GPR2                :1;
        unsigned VB0GPR3                :1;
        unsigned VB0GPR4                :1;
        unsigned VB0GPR5                :1;
        unsigned VB0GPR6                :1;
        unsigned VB0GPR7                :1;
    };
} VB0GPRbits_t;
extern volatile VB0GPRbits_t VB0GPRbits __at(0xE8C);
// bitfield macros
#define _VB0GPR_VB0GPR_POSN                                 0x0
#define _VB0GPR_VB0GPR_POSITION                             0x0
#define _VB0GPR_VB0GPR_SIZE                                 0x8
#define _VB0GPR_VB0GPR_LENGTH                               0x8
#define _VB0GPR_VB0GPR_MASK                                 0xFF
#define _VB0GPR_VB0GPR0_POSN                                0x0
#define _VB0GPR_VB0GPR0_POSITION                            0x0
#define _VB0GPR_VB0GPR0_SIZE                                0x1
#define _VB0GPR_VB0GPR0_LENGTH                              0x1
#define _VB0GPR_VB0GPR0_MASK                                0x1
#define _VB0GPR_VB0GPR1_POSN                                0x1
#define _VB0GPR_VB0GPR1_POSITION                            0x1
#define _VB0GPR_VB0GPR1_SIZE                                0x1
#define _VB0GPR_VB0GPR1_LENGTH                              0x1
#define _VB0GPR_VB0GPR1_MASK                                0x2
#define _VB0GPR_VB0GPR2_POSN                                0x2
#define _VB0GPR_VB0GPR2_POSITION                            0x2
#define _VB0GPR_VB0GPR2_SIZE                                0x1
#define _VB0GPR_VB0GPR2_LENGTH                              0x1
#define _VB0GPR_VB0GPR2_MASK                                0x4
#define _VB0GPR_VB0GPR3_POSN                                0x3
#define _VB0GPR_VB0GPR3_POSITION                            0x3
#define _VB0GPR_VB0GPR3_SIZE                                0x1
#define _VB0GPR_VB0GPR3_LENGTH                              0x1
#define _VB0GPR_VB0GPR3_MASK                                0x8
#define _VB0GPR_VB0GPR4_POSN                                0x4
#define _VB0GPR_VB0GPR4_POSITION                            0x4
#define _VB0GPR_VB0GPR4_SIZE                                0x1
#define _VB0GPR_VB0GPR4_LENGTH                              0x1
#define _VB0GPR_VB0GPR4_MASK                                0x10
#define _VB0GPR_VB0GPR5_POSN                                0x5
#define _VB0GPR_VB0GPR5_POSITION                            0x5
#define _VB0GPR_VB0GPR5_SIZE                                0x1
#define _VB0GPR_VB0GPR5_LENGTH                              0x1
#define _VB0GPR_VB0GPR5_MASK                                0x20
#define _VB0GPR_VB0GPR6_POSN                                0x6
#define _VB0GPR_VB0GPR6_POSITION                            0x6
#define _VB0GPR_VB0GPR6_SIZE                                0x1
#define _VB0GPR_VB0GPR6_LENGTH                              0x1
#define _VB0GPR_VB0GPR6_MASK                                0x40
#define _VB0GPR_VB0GPR7_POSN                                0x7
#define _VB0GPR_VB0GPR7_POSITION                            0x7
#define _VB0GPR_VB0GPR7_SIZE                                0x1
#define _VB0GPR_VB0GPR7_LENGTH                              0x1
#define _VB0GPR_VB0GPR7_MASK                                0x80

// Register: VB1GPR
#define VB1GPR VB1GPR
extern volatile unsigned char           VB1GPR              __at(0xE8D);
#ifndef _LIB_BUILD
asm("VB1GPR equ 0E8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VB1GPR                 :8;
    };
    struct {
        unsigned VB1GPR0                :1;
        unsigned VB1GPR1                :1;
        unsigned VB1GPR2                :1;
        unsigned VB1GPR3                :1;
        unsigned VB1GPR4                :1;
        unsigned VB1GPR5                :1;
        unsigned VB1GPR6                :1;
        unsigned VB1GPR7                :1;
    };
} VB1GPRbits_t;
extern volatile VB1GPRbits_t VB1GPRbits __at(0xE8D);
// bitfield macros
#define _VB1GPR_VB1GPR_POSN                                 0x0
#define _VB1GPR_VB1GPR_POSITION                             0x0
#define _VB1GPR_VB1GPR_SIZE                                 0x8
#define _VB1GPR_VB1GPR_LENGTH                               0x8
#define _VB1GPR_VB1GPR_MASK                                 0xFF
#define _VB1GPR_VB1GPR0_POSN                                0x0
#define _VB1GPR_VB1GPR0_POSITION                            0x0
#define _VB1GPR_VB1GPR0_SIZE                                0x1
#define _VB1GPR_VB1GPR0_LENGTH                              0x1
#define _VB1GPR_VB1GPR0_MASK                                0x1
#define _VB1GPR_VB1GPR1_POSN                                0x1
#define _VB1GPR_VB1GPR1_POSITION                            0x1
#define _VB1GPR_VB1GPR1_SIZE                                0x1
#define _VB1GPR_VB1GPR1_LENGTH                              0x1
#define _VB1GPR_VB1GPR1_MASK                                0x2
#define _VB1GPR_VB1GPR2_POSN                                0x2
#define _VB1GPR_VB1GPR2_POSITION                            0x2
#define _VB1GPR_VB1GPR2_SIZE                                0x1
#define _VB1GPR_VB1GPR2_LENGTH                              0x1
#define _VB1GPR_VB1GPR2_MASK                                0x4
#define _VB1GPR_VB1GPR3_POSN                                0x3
#define _VB1GPR_VB1GPR3_POSITION                            0x3
#define _VB1GPR_VB1GPR3_SIZE                                0x1
#define _VB1GPR_VB1GPR3_LENGTH                              0x1
#define _VB1GPR_VB1GPR3_MASK                                0x8
#define _VB1GPR_VB1GPR4_POSN                                0x4
#define _VB1GPR_VB1GPR4_POSITION                            0x4
#define _VB1GPR_VB1GPR4_SIZE                                0x1
#define _VB1GPR_VB1GPR4_LENGTH                              0x1
#define _VB1GPR_VB1GPR4_MASK                                0x10
#define _VB1GPR_VB1GPR5_POSN                                0x5
#define _VB1GPR_VB1GPR5_POSITION                            0x5
#define _VB1GPR_VB1GPR5_SIZE                                0x1
#define _VB1GPR_VB1GPR5_LENGTH                              0x1
#define _VB1GPR_VB1GPR5_MASK                                0x20
#define _VB1GPR_VB1GPR6_POSN                                0x6
#define _VB1GPR_VB1GPR6_POSITION                            0x6
#define _VB1GPR_VB1GPR6_SIZE                                0x1
#define _VB1GPR_VB1GPR6_LENGTH                              0x1
#define _VB1GPR_VB1GPR6_MASK                                0x40
#define _VB1GPR_VB1GPR7_POSN                                0x7
#define _VB1GPR_VB1GPR7_POSITION                            0x7
#define _VB1GPR_VB1GPR7_SIZE                                0x1
#define _VB1GPR_VB1GPR7_LENGTH                              0x1
#define _VB1GPR_VB1GPR7_MASK                                0x80

