MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19196/mcu.h
extern volatile LCDDATA24bits_t LCDDATA24bits __at(0x1D30);
// bitfield macros
#define _LCDDATA24_S00C4_POSN                               0x0
#define _LCDDATA24_S00C4_POSITION                           0x0
#define _LCDDATA24_S00C4_SIZE                               0x1
#define _LCDDATA24_S00C4_LENGTH                             0x1
#define _LCDDATA24_S00C4_MASK                               0x1
#define _LCDDATA24_S01C4_POSN                               0x1
#define _LCDDATA24_S01C4_POSITION                           0x1
#define _LCDDATA24_S01C4_SIZE                               0x1
#define _LCDDATA24_S01C4_LENGTH                             0x1
#define _LCDDATA24_S01C4_MASK                               0x2
#define _LCDDATA24_S02C4_POSN                               0x2
#define _LCDDATA24_S02C4_POSITION                           0x2
#define _LCDDATA24_S02C4_SIZE                               0x1
#define _LCDDATA24_S02C4_LENGTH                             0x1
#define _LCDDATA24_S02C4_MASK                               0x4
#define _LCDDATA24_S03C4_POSN                               0x3
#define _LCDDATA24_S03C4_POSITION                           0x3
#define _LCDDATA24_S03C4_SIZE                               0x1
#define _LCDDATA24_S03C4_LENGTH                             0x1
#define _LCDDATA24_S03C4_MASK                               0x8
#define _LCDDATA24_S04C4_POSN                               0x4
#define _LCDDATA24_S04C4_POSITION                           0x4
#define _LCDDATA24_S04C4_SIZE                               0x1
#define _LCDDATA24_S04C4_LENGTH                             0x1
#define _LCDDATA24_S04C4_MASK                               0x10
#define _LCDDATA24_S05C4_POSN                               0x5
#define _LCDDATA24_S05C4_POSITION                           0x5
#define _LCDDATA24_S05C4_SIZE                               0x1
#define _LCDDATA24_S05C4_LENGTH                             0x1
#define _LCDDATA24_S05C4_MASK                               0x20
#define _LCDDATA24_S06C4_POSN                               0x6
#define _LCDDATA24_S06C4_POSITION                           0x6
#define _LCDDATA24_S06C4_SIZE                               0x1
#define _LCDDATA24_S06C4_LENGTH                             0x1
#define _LCDDATA24_S06C4_MASK                               0x40
#define _LCDDATA24_S07C4_POSN                               0x7
#define _LCDDATA24_S07C4_POSITION                           0x7
#define _LCDDATA24_S07C4_SIZE                               0x1
#define _LCDDATA24_S07C4_LENGTH                             0x1
#define _LCDDATA24_S07C4_MASK                               0x80

// Register: LCDDATA25
#define LCDDATA25 LCDDATA25
extern volatile unsigned char           LCDDATA25           __at(0x1D31);
#ifndef _LIB_BUILD
asm("LCDDATA25 equ 01D31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C4                  :1;
        unsigned S09C4                  :1;
        unsigned S10C4                  :1;
        unsigned S11C4                  :1;
        unsigned S12C4                  :1;
        unsigned S13C4                  :1;
        unsigned S14C4                  :1;
        unsigned S15C4                  :1;
    };
} LCDDATA25bits_t;
extern volatile LCDDATA25bits_t LCDDATA25bits __at(0x1D31);
// bitfield macros
#define _LCDDATA25_S08C4_POSN                               0x0
#define _LCDDATA25_S08C4_POSITION                           0x0
#define _LCDDATA25_S08C4_SIZE                               0x1
#define _LCDDATA25_S08C4_LENGTH                             0x1
#define _LCDDATA25_S08C4_MASK                               0x1
#define _LCDDATA25_S09C4_POSN                               0x1
#define _LCDDATA25_S09C4_POSITION                           0x1
#define _LCDDATA25_S09C4_SIZE                               0x1
#define _LCDDATA25_S09C4_LENGTH                             0x1
#define _LCDDATA25_S09C4_MASK                               0x2
#define _LCDDATA25_S10C4_POSN                               0x2
#define _LCDDATA25_S10C4_POSITION                           0x2
#define _LCDDATA25_S10C4_SIZE                               0x1
#define _LCDDATA25_S10C4_LENGTH                             0x1
#define _LCDDATA25_S10C4_MASK                               0x4
#define _LCDDATA25_S11C4_POSN                               0x3
#define _LCDDATA25_S11C4_POSITION                           0x3
#define _LCDDATA25_S11C4_SIZE                               0x1
#define _LCDDATA25_S11C4_LENGTH                             0x1
#define _LCDDATA25_S11C4_MASK                               0x8
#define _LCDDATA25_S12C4_POSN                               0x4
#define _LCDDATA25_S12C4_POSITION                           0x4
#define _LCDDATA25_S12C4_SIZE                               0x1
#define _LCDDATA25_S12C4_LENGTH                             0x1
#define _LCDDATA25_S12C4_MASK                               0x10
#define _LCDDATA25_S13C4_POSN                               0x5
#define _LCDDATA25_S13C4_POSITION                           0x5
#define _LCDDATA25_S13C4_SIZE                               0x1
#define _LCDDATA25_S13C4_LENGTH                             0x1
#define _LCDDATA25_S13C4_MASK                               0x20
#define _LCDDATA25_S14C4_POSN                               0x6
#define _LCDDATA25_S14C4_POSITION                           0x6
#define _LCDDATA25_S14C4_SIZE                               0x1
#define _LCDDATA25_S14C4_LENGTH                             0x1
#define _LCDDATA25_S14C4_MASK                               0x40
#define _LCDDATA25_S15C4_POSN                               0x7
#define _LCDDATA25_S15C4_POSITION                           0x7
#define _LCDDATA25_S15C4_SIZE                               0x1
#define _LCDDATA25_S15C4_LENGTH                             0x1
#define _LCDDATA25_S15C4_MASK                               0x80

// Register: LCDDATA26
#define LCDDATA26 LCDDATA26
extern volatile unsigned char           LCDDATA26           __at(0x1D32);
#ifndef _LIB_BUILD
asm("LCDDATA26 equ 01D32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C4                  :1;
        unsigned S17C4                  :1;
        unsigned S18C4                  :1;
        unsigned S19C4                  :1;
        unsigned S20C4                  :1;
        unsigned S21C4                  :1;
        unsigned S22C4                  :1;
        unsigned S23C4                  :1;
    };
} LCDDATA26bits_t;
extern volatile LCDDATA26bits_t LCDDATA26bits __at(0x1D32);
// bitfield macros
#define _LCDDATA26_S16C4_POSN                               0x0
#define _LCDDATA26_S16C4_POSITION                           0x0
#define _LCDDATA26_S16C4_SIZE                               0x1
#define _LCDDATA26_S16C4_LENGTH                             0x1
#define _LCDDATA26_S16C4_MASK                               0x1
#define _LCDDATA26_S17C4_POSN                               0x1
#define _LCDDATA26_S17C4_POSITION                           0x1
#define _LCDDATA26_S17C4_SIZE                               0x1
#define _LCDDATA26_S17C4_LENGTH                             0x1
#define _LCDDATA26_S17C4_MASK                               0x2
#define _LCDDATA26_S18C4_POSN                               0x2
#define _LCDDATA26_S18C4_POSITION                           0x2
#define _LCDDATA26_S18C4_SIZE                               0x1
#define _LCDDATA26_S18C4_LENGTH                             0x1
#define _LCDDATA26_S18C4_MASK                               0x4
#define _LCDDATA26_S19C4_POSN                               0x3
#define _LCDDATA26_S19C4_POSITION                           0x3
#define _LCDDATA26_S19C4_SIZE                               0x1
#define _LCDDATA26_S19C4_LENGTH                             0x1
#define _LCDDATA26_S19C4_MASK                               0x8
#define _LCDDATA26_S20C4_POSN                               0x4
#define _LCDDATA26_S20C4_POSITION                           0x4
#define _LCDDATA26_S20C4_SIZE                               0x1
#define _LCDDATA26_S20C4_LENGTH                             0x1
#define _LCDDATA26_S20C4_MASK                               0x10
#define _LCDDATA26_S21C4_POSN                               0x5
#define _LCDDATA26_S21C4_POSITION                           0x5
#define _LCDDATA26_S21C4_SIZE                               0x1
#define _LCDDATA26_S21C4_LENGTH                             0x1
#define _LCDDATA26_S21C4_MASK                               0x20
#define _LCDDATA26_S22C4_POSN                               0x6
#define _LCDDATA26_S22C4_POSITION                           0x6
#define _LCDDATA26_S22C4_SIZE                               0x1
#define _LCDDATA26_S22C4_LENGTH                             0x1
#define _LCDDATA26_S22C4_MASK                               0x40
#define _LCDDATA26_S23C4_POSN                               0x7
#define _LCDDATA26_S23C4_POSITION                           0x7
#define _LCDDATA26_S23C4_SIZE                               0x1
#define _LCDDATA26_S23C4_LENGTH                             0x1
#define _LCDDATA26_S23C4_MASK                               0x80

// Register: LCDDATA27
#define LCDDATA27 LCDDATA27
extern volatile unsigned char           LCDDATA27           __at(0x1D33);
#ifndef _LIB_BUILD
asm("LCDDATA27 equ 01D33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C4                  :1;
        unsigned S25C4                  :1;
        unsigned S26C4                  :1;
        unsigned S27C4                  :1;
        unsigned S28C4                  :1;
        unsigned S29C4                  :1;
        unsigned S30C4                  :1;
        unsigned S31C4                  :1;
    };
} LCDDATA27bits_t;
extern volatile LCDDATA27bits_t LCDDATA27bits __at(0x1D33);
// bitfield macros
#define _LCDDATA27_S24C4_POSN                               0x0
#define _LCDDATA27_S24C4_POSITION                           0x0
#define _LCDDATA27_S24C4_SIZE                               0x1
#define _LCDDATA27_S24C4_LENGTH                             0x1
#define _LCDDATA27_S24C4_MASK                               0x1
#define _LCDDATA27_S25C4_POSN                               0x1
#define _LCDDATA27_S25C4_POSITION                           0x1
#define _LCDDATA27_S25C4_SIZE                               0x1
#define _LCDDATA27_S25C4_LENGTH                             0x1
#define _LCDDATA27_S25C4_MASK                               0x2
#define _LCDDATA27_S26C4_POSN                               0x2
#define _LCDDATA27_S26C4_POSITION                           0x2
#define _LCDDATA27_S26C4_SIZE                               0x1
#define _LCDDATA27_S26C4_LENGTH                             0x1
#define _LCDDATA27_S26C4_MASK                               0x4
#define _LCDDATA27_S27C4_POSN                               0x3
#define _LCDDATA27_S27C4_POSITION                           0x3
#define _LCDDATA27_S27C4_SIZE                               0x1
#define _LCDDATA27_S27C4_LENGTH                             0x1
#define _LCDDATA27_S27C4_MASK                               0x8
#define _LCDDATA27_S28C4_POSN                               0x4
#define _LCDDATA27_S28C4_POSITION                           0x4
#define _LCDDATA27_S28C4_SIZE                               0x1
#define _LCDDATA27_S28C4_LENGTH                             0x1
#define _LCDDATA27_S28C4_MASK                               0x10
#define _LCDDATA27_S29C4_POSN                               0x5
#define _LCDDATA27_S29C4_POSITION                           0x5
#define _LCDDATA27_S29C4_SIZE                               0x1
#define _LCDDATA27_S29C4_LENGTH                             0x1
#define _LCDDATA27_S29C4_MASK                               0x20
#define _LCDDATA27_S30C4_POSN                               0x6
#define _LCDDATA27_S30C4_POSITION                           0x6
#define _LCDDATA27_S30C4_SIZE                               0x1
#define _LCDDATA27_S30C4_LENGTH                             0x1
#define _LCDDATA27_S30C4_MASK                               0x40
#define _LCDDATA27_S31C4_POSN                               0x7
#define _LCDDATA27_S31C4_POSITION                           0x7
#define _LCDDATA27_S31C4_SIZE                               0x1
#define _LCDDATA27_S31C4_LENGTH                             0x1
#define _LCDDATA27_S31C4_MASK                               0x80

// Register: LCDDATA28
#define LCDDATA28 LCDDATA28
extern volatile unsigned char           LCDDATA28           __at(0x1D34);
#ifndef _LIB_BUILD
asm("LCDDATA28 equ 01D34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C4                  :1;
        unsigned S33C4                  :1;
        unsigned S34C4                  :1;
        unsigned S35C4                  :1;
        unsigned S36C4                  :1;
        unsigned S37C4                  :1;
        unsigned S38C4                  :1;
        unsigned S39C4                  :1;
    };
} LCDDATA28bits_t;
