MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19196/mcu.h
// Register: RG3PPS
#define RG3PPS RG3PPS
extern volatile unsigned char           RG3PPS              __at(0x1E43);
#ifndef _LIB_BUILD
asm("RG3PPS equ 01E43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG3PPS0                :1;
        unsigned RG3PPS1                :1;
        unsigned RG3PPS2                :1;
        unsigned RG3PPS3                :1;
        unsigned RG3PPS4                :1;
        unsigned RG3PPS5                :1;
    };
} RG3PPSbits_t;
extern volatile RG3PPSbits_t RG3PPSbits __at(0x1E43);
// bitfield macros
#define _RG3PPS_RG3PPS0_POSN                                0x0
#define _RG3PPS_RG3PPS0_POSITION                            0x0
#define _RG3PPS_RG3PPS0_SIZE                                0x1
#define _RG3PPS_RG3PPS0_LENGTH                              0x1
#define _RG3PPS_RG3PPS0_MASK                                0x1
#define _RG3PPS_RG3PPS1_POSN                                0x1
#define _RG3PPS_RG3PPS1_POSITION                            0x1
#define _RG3PPS_RG3PPS1_SIZE                                0x1
#define _RG3PPS_RG3PPS1_LENGTH                              0x1
#define _RG3PPS_RG3PPS1_MASK                                0x2
#define _RG3PPS_RG3PPS2_POSN                                0x2
#define _RG3PPS_RG3PPS2_POSITION                            0x2
#define _RG3PPS_RG3PPS2_SIZE                                0x1
#define _RG3PPS_RG3PPS2_LENGTH                              0x1
#define _RG3PPS_RG3PPS2_MASK                                0x4
#define _RG3PPS_RG3PPS3_POSN                                0x3
#define _RG3PPS_RG3PPS3_POSITION                            0x3
#define _RG3PPS_RG3PPS3_SIZE                                0x1
#define _RG3PPS_RG3PPS3_LENGTH                              0x1
#define _RG3PPS_RG3PPS3_MASK                                0x8
#define _RG3PPS_RG3PPS4_POSN                                0x4
#define _RG3PPS_RG3PPS4_POSITION                            0x4
#define _RG3PPS_RG3PPS4_SIZE                                0x1
#define _RG3PPS_RG3PPS4_LENGTH                              0x1
#define _RG3PPS_RG3PPS4_MASK                                0x10
#define _RG3PPS_RG3PPS5_POSN                                0x5
#define _RG3PPS_RG3PPS5_POSITION                            0x5
#define _RG3PPS_RG3PPS5_SIZE                                0x1
#define _RG3PPS_RG3PPS5_LENGTH                              0x1
#define _RG3PPS_RG3PPS5_MASK                                0x20

// Register: RG4PPS
#define RG4PPS RG4PPS
extern volatile unsigned char           RG4PPS              __at(0x1E44);
#ifndef _LIB_BUILD
asm("RG4PPS equ 01E44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG4PPS0                :1;
        unsigned RG4PPS1                :1;
        unsigned RG4PPS2                :1;
        unsigned RG4PPS3                :1;
        unsigned RG4PPS4                :1;
        unsigned RG4PPS5                :1;
    };
} RG4PPSbits_t;
extern volatile RG4PPSbits_t RG4PPSbits __at(0x1E44);
// bitfield macros
#define _RG4PPS_RG4PPS0_POSN                                0x0
#define _RG4PPS_RG4PPS0_POSITION                            0x0
#define _RG4PPS_RG4PPS0_SIZE                                0x1
#define _RG4PPS_RG4PPS0_LENGTH                              0x1
#define _RG4PPS_RG4PPS0_MASK                                0x1
#define _RG4PPS_RG4PPS1_POSN                                0x1
#define _RG4PPS_RG4PPS1_POSITION                            0x1
#define _RG4PPS_RG4PPS1_SIZE                                0x1
#define _RG4PPS_RG4PPS1_LENGTH                              0x1
#define _RG4PPS_RG4PPS1_MASK                                0x2
#define _RG4PPS_RG4PPS2_POSN                                0x2
#define _RG4PPS_RG4PPS2_POSITION                            0x2
#define _RG4PPS_RG4PPS2_SIZE                                0x1
#define _RG4PPS_RG4PPS2_LENGTH                              0x1
#define _RG4PPS_RG4PPS2_MASK                                0x4
#define _RG4PPS_RG4PPS3_POSN                                0x3
#define _RG4PPS_RG4PPS3_POSITION                            0x3
#define _RG4PPS_RG4PPS3_SIZE                                0x1
#define _RG4PPS_RG4PPS3_LENGTH                              0x1
#define _RG4PPS_RG4PPS3_MASK                                0x8
#define _RG4PPS_RG4PPS4_POSN                                0x4
#define _RG4PPS_RG4PPS4_POSITION                            0x4
#define _RG4PPS_RG4PPS4_SIZE                                0x1
#define _RG4PPS_RG4PPS4_LENGTH                              0x1
#define _RG4PPS_RG4PPS4_MASK                                0x10
#define _RG4PPS_RG4PPS5_POSN                                0x5
#define _RG4PPS_RG4PPS5_POSITION                            0x5
#define _RG4PPS_RG4PPS5_SIZE                                0x1
#define _RG4PPS_RG4PPS5_LENGTH                              0x1
#define _RG4PPS_RG4PPS5_MASK                                0x20

// Register: RG6PPS
#define RG6PPS RG6PPS
extern volatile unsigned char           RG6PPS              __at(0x1E46);
#ifndef _LIB_BUILD
asm("RG6PPS equ 01E46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG6PPS0                :1;
        unsigned RG6PPS1                :1;
        unsigned RG6PPS2                :1;
        unsigned RG6PPS3                :1;
        unsigned RG6PPS4                :1;
        unsigned RG6PPS5                :1;
    };
} RG6PPSbits_t;
extern volatile RG6PPSbits_t RG6PPSbits __at(0x1E46);
// bitfield macros
#define _RG6PPS_RG6PPS0_POSN                                0x0
#define _RG6PPS_RG6PPS0_POSITION                            0x0
#define _RG6PPS_RG6PPS0_SIZE                                0x1
#define _RG6PPS_RG6PPS0_LENGTH                              0x1
#define _RG6PPS_RG6PPS0_MASK                                0x1
#define _RG6PPS_RG6PPS1_POSN                                0x1
#define _RG6PPS_RG6PPS1_POSITION                            0x1
#define _RG6PPS_RG6PPS1_SIZE                                0x1
#define _RG6PPS_RG6PPS1_LENGTH                              0x1
#define _RG6PPS_RG6PPS1_MASK                                0x2
#define _RG6PPS_RG6PPS2_POSN                                0x2
#define _RG6PPS_RG6PPS2_POSITION                            0x2
#define _RG6PPS_RG6PPS2_SIZE                                0x1
#define _RG6PPS_RG6PPS2_LENGTH                              0x1
#define _RG6PPS_RG6PPS2_MASK                                0x4
#define _RG6PPS_RG6PPS3_POSN                                0x3
#define _RG6PPS_RG6PPS3_POSITION                            0x3
#define _RG6PPS_RG6PPS3_SIZE                                0x1
#define _RG6PPS_RG6PPS3_LENGTH                              0x1
#define _RG6PPS_RG6PPS3_MASK                                0x8
#define _RG6PPS_RG6PPS4_POSN                                0x4
#define _RG6PPS_RG6PPS4_POSITION                            0x4
#define _RG6PPS_RG6PPS4_SIZE                                0x1
#define _RG6PPS_RG6PPS4_LENGTH                              0x1
#define _RG6PPS_RG6PPS4_MASK                                0x10
#define _RG6PPS_RG6PPS5_POSN                                0x5
#define _RG6PPS_RG6PPS5_POSITION                            0x5
#define _RG6PPS_RG6PPS5_SIZE                                0x1
#define _RG6PPS_RG6PPS5_LENGTH                              0x1
#define _RG6PPS_RG6PPS5_MASK                                0x20

// Register: RG7PPS
#define RG7PPS RG7PPS
extern volatile unsigned char           RG7PPS              __at(0x1E47);
#ifndef _LIB_BUILD
asm("RG7PPS equ 01E47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG7PPS0                :1;
        unsigned RG7PPS1                :1;
        unsigned RG7PPS2                :1;
        unsigned RG7PPS3                :1;
        unsigned RG7PPS4                :1;
        unsigned RG7PPS5                :1;
    };
} RG7PPSbits_t;
extern volatile RG7PPSbits_t RG7PPSbits __at(0x1E47);
// bitfield macros
#define _RG7PPS_RG7PPS0_POSN                                0x0
#define _RG7PPS_RG7PPS0_POSITION                            0x0
#define _RG7PPS_RG7PPS0_SIZE                                0x1
#define _RG7PPS_RG7PPS0_LENGTH                              0x1
#define _RG7PPS_RG7PPS0_MASK                                0x1
#define _RG7PPS_RG7PPS1_POSN                                0x1
#define _RG7PPS_RG7PPS1_POSITION                            0x1
#define _RG7PPS_RG7PPS1_SIZE                                0x1
#define _RG7PPS_RG7PPS1_LENGTH                              0x1
#define _RG7PPS_RG7PPS1_MASK                                0x2
#define _RG7PPS_RG7PPS2_POSN                                0x2
#define _RG7PPS_RG7PPS2_POSITION                            0x2
#define _RG7PPS_RG7PPS2_SIZE                                0x1
#define _RG7PPS_RG7PPS2_LENGTH                              0x1
#define _RG7PPS_RG7PPS2_MASK                                0x4
#define _RG7PPS_RG7PPS3_POSN                                0x3
#define _RG7PPS_RG7PPS3_POSITION                            0x3
#define _RG7PPS_RG7PPS3_SIZE                                0x1
#define _RG7PPS_RG7PPS3_LENGTH                              0x1
#define _RG7PPS_RG7PPS3_MASK                                0x8
#define _RG7PPS_RG7PPS4_POSN                                0x4
#define _RG7PPS_RG7PPS4_POSITION                            0x4
#define _RG7PPS_RG7PPS4_SIZE                                0x1
#define _RG7PPS_RG7PPS4_LENGTH                              0x1
#define _RG7PPS_RG7PPS4_MASK                                0x10
#define _RG7PPS_RG7PPS5_POSN                                0x5
#define _RG7PPS_RG7PPS5_POSITION                            0x5
#define _RG7PPS_RG7PPS5_SIZE                                0x1
#define _RG7PPS_RG7PPS5_LENGTH                              0x1
#define _RG7PPS_RG7PPS5_MASK                                0x20

// Register: RH0PPS
#define RH0PPS RH0PPS
extern volatile unsigned char           RH0PPS              __at(0x1E48);
#ifndef _LIB_BUILD
asm("RH0PPS equ 01E48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH0PPS0                :1;
        unsigned RH0PPS1                :1;
        unsigned RH0PPS2                :1;
        unsigned RH0PPS3                :1;
        unsigned RH0PPS4                :1;
        unsigned RH0PPS5                :1;
    };
} RH0PPSbits_t;
extern volatile RH0PPSbits_t RH0PPSbits __at(0x1E48);
// bitfield macros
#define _RH0PPS_RH0PPS0_POSN                                0x0
#define _RH0PPS_RH0PPS0_POSITION                            0x0
#define _RH0PPS_RH0PPS0_SIZE                                0x1
#define _RH0PPS_RH0PPS0_LENGTH                              0x1
#define _RH0PPS_RH0PPS0_MASK                                0x1
#define _RH0PPS_RH0PPS1_POSN                                0x1
#define _RH0PPS_RH0PPS1_POSITION                            0x1
#define _RH0PPS_RH0PPS1_SIZE                                0x1
#define _RH0PPS_RH0PPS1_LENGTH                              0x1
#define _RH0PPS_RH0PPS1_MASK                                0x2
#define _RH0PPS_RH0PPS2_POSN                                0x2
#define _RH0PPS_RH0PPS2_POSITION                            0x2
#define _RH0PPS_RH0PPS2_SIZE                                0x1
#define _RH0PPS_RH0PPS2_LENGTH                              0x1
#define _RH0PPS_RH0PPS2_MASK                                0x4
#define _RH0PPS_RH0PPS3_POSN                                0x3
#define _RH0PPS_RH0PPS3_POSITION                            0x3
#define _RH0PPS_RH0PPS3_SIZE                                0x1
#define _RH0PPS_RH0PPS3_LENGTH                              0x1
#define _RH0PPS_RH0PPS3_MASK                                0x8
#define _RH0PPS_RH0PPS4_POSN                                0x4
#define _RH0PPS_RH0PPS4_POSITION                            0x4
#define _RH0PPS_RH0PPS4_SIZE                                0x1
#define _RH0PPS_RH0PPS4_LENGTH                              0x1
#define _RH0PPS_RH0PPS4_MASK                                0x10
#define _RH0PPS_RH0PPS5_POSN                                0x5
#define _RH0PPS_RH0PPS5_POSITION                            0x5
#define _RH0PPS_RH0PPS5_SIZE                                0x1
#define _RH0PPS_RH0PPS5_LENGTH                              0x1
#define _RH0PPS_RH0PPS5_MASK                                0x20

// Register: RH1PPS
#define RH1PPS RH1PPS
extern volatile unsigned char           RH1PPS              __at(0x1E49);
#ifndef _LIB_BUILD
asm("RH1PPS equ 01E49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH1PPS0                :1;
        unsigned RH1PPS1                :1;
        unsigned RH1PPS2                :1;
        unsigned RH1PPS3                :1;
        unsigned RH1PPS4                :1;
        unsigned RH1PPS5                :1;
    };
} RH1PPSbits_t;
