MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19196/mcu.h
#define                                 ADPREF0_bit         _BIT_ACCESS(ADREF,0)
// ADREF<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x8B1);	// @ (0x116 * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADREF,1)
// ADPREVL<ADPREV0>
extern volatile __bit                   ADPREV0             __at(0x4D8);	// @ (0x9B * 8 + 0)
#define                                 ADPREV0_bit         _BIT_ACCESS(ADPREVL,0)
// ADPREVL<ADPREV1>
extern volatile __bit                   ADPREV1             __at(0x4D9);	// @ (0x9B * 8 + 1)
#define                                 ADPREV1_bit         _BIT_ACCESS(ADPREVL,1)
// ADPREVH<ADPREV10>
extern volatile __bit                   ADPREV10            __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 ADPREV10_bit        _BIT_ACCESS(ADPREVH,2)
// ADPREVH<ADPREV11>
extern volatile __bit                   ADPREV11            __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 ADPREV11_bit        _BIT_ACCESS(ADPREVH,3)
// ADPREVH<ADPREV12>
extern volatile __bit                   ADPREV12            __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 ADPREV12_bit        _BIT_ACCESS(ADPREVH,4)
// ADPREVH<ADPREV13>
extern volatile __bit                   ADPREV13            __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 ADPREV13_bit        _BIT_ACCESS(ADPREVH,5)
// ADPREVH<ADPREV14>
extern volatile __bit                   ADPREV14            __at(0x4E6);	// @ (0x9C * 8 + 6)
#define                                 ADPREV14_bit        _BIT_ACCESS(ADPREVH,6)
// ADPREVH<ADPREV15>
extern volatile __bit                   ADPREV15            __at(0x4E7);	// @ (0x9C * 8 + 7)
#define                                 ADPREV15_bit        _BIT_ACCESS(ADPREVH,7)
// ADPREVL<ADPREV2>
extern volatile __bit                   ADPREV2             __at(0x4DA);	// @ (0x9B * 8 + 2)
#define                                 ADPREV2_bit         _BIT_ACCESS(ADPREVL,2)
// ADPREVL<ADPREV3>
extern volatile __bit                   ADPREV3             __at(0x4DB);	// @ (0x9B * 8 + 3)
#define                                 ADPREV3_bit         _BIT_ACCESS(ADPREVL,3)
// ADPREVL<ADPREV4>
extern volatile __bit                   ADPREV4             __at(0x4DC);	// @ (0x9B * 8 + 4)
#define                                 ADPREV4_bit         _BIT_ACCESS(ADPREVL,4)
// ADPREVL<ADPREV5>
extern volatile __bit                   ADPREV5             __at(0x4DD);	// @ (0x9B * 8 + 5)
#define                                 ADPREV5_bit         _BIT_ACCESS(ADPREVL,5)
// ADPREVL<ADPREV6>
extern volatile __bit                   ADPREV6             __at(0x4DE);	// @ (0x9B * 8 + 6)
#define                                 ADPREV6_bit         _BIT_ACCESS(ADPREVL,6)
// ADPREVL<ADPREV7>
extern volatile __bit                   ADPREV7             __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 ADPREV7_bit         _BIT_ACCESS(ADPREVL,7)
// ADPREVH<ADPREV8>
extern volatile __bit                   ADPREV8             __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 ADPREV8_bit         _BIT_ACCESS(ADPREVH,0)
// ADPREVH<ADPREV9>
extern volatile __bit                   ADPREV9             __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 ADPREV9_bit         _BIT_ACCESS(ADPREVH,1)
// ADCON2<ADPSIS>
extern volatile __bit                   ADPSIS              __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 ADPSIS_bit          _BIT_ACCESS(ADCON2,7)
// ADRESL<ADRES0>
extern volatile __bit                   ADRES0              __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ADRES0_bit          _BIT_ACCESS(ADRESL,0)
// ADRESL<ADRES1>
extern volatile __bit                   ADRES1              __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADRES1_bit          _BIT_ACCESS(ADRESL,1)
// ADRESH<ADRES10>
extern volatile __bit                   ADRES10             __at(0x4F2);	// @ (0x9E * 8 + 2)
#define                                 ADRES10_bit         _BIT_ACCESS(ADRESH,2)
// ADRESH<ADRES11>
extern volatile __bit                   ADRES11             __at(0x4F3);	// @ (0x9E * 8 + 3)
#define                                 ADRES11_bit         _BIT_ACCESS(ADRESH,3)
// ADRESH<ADRES12>
extern volatile __bit                   ADRES12             __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 ADRES12_bit         _BIT_ACCESS(ADRESH,4)
// ADRESH<ADRES13>
extern volatile __bit                   ADRES13             __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 ADRES13_bit         _BIT_ACCESS(ADRESH,5)
// ADRESH<ADRES14>
extern volatile __bit                   ADRES14             __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 ADRES14_bit         _BIT_ACCESS(ADRESH,6)
// ADRESH<ADRES15>
extern volatile __bit                   ADRES15             __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 ADRES15_bit         _BIT_ACCESS(ADRESH,7)
// ADRESL<ADRES2>
extern volatile __bit                   ADRES2              __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 ADRES2_bit          _BIT_ACCESS(ADRESL,2)
// ADRESL<ADRES3>
extern volatile __bit                   ADRES3              __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 ADRES3_bit          _BIT_ACCESS(ADRESL,3)
// ADRESL<ADRES4>
extern volatile __bit                   ADRES4              __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 ADRES4_bit          _BIT_ACCESS(ADRESL,4)
// ADRESL<ADRES5>
extern volatile __bit                   ADRES5              __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 ADRES5_bit          _BIT_ACCESS(ADRESL,5)
// ADRESL<ADRES6>
extern volatile __bit                   ADRES6              __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 ADRES6_bit          _BIT_ACCESS(ADRESL,6)
// ADRESL<ADRES7>
extern volatile __bit                   ADRES7              __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 ADRES7_bit          _BIT_ACCESS(ADRESL,7)
// ADRESH<ADRES8>
extern volatile __bit                   ADRES8              __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 ADRES8_bit          _BIT_ACCESS(ADRESH,0)
// ADRESH<ADRES9>
extern volatile __bit                   ADRES9              __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 ADRES9_bit          _BIT_ACCESS(ADRESH,1)
// ADRPT<ADRPT0>
extern volatile __bit                   ADRPT0              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 ADRPT0_bit          _BIT_ACCESS(ADRPT,0)
// ADRPT<ADRPT1>
extern volatile __bit                   ADRPT1              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 ADRPT1_bit          _BIT_ACCESS(ADRPT,1)
// ADRPT<ADRPT2>
extern volatile __bit                   ADRPT2              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 ADRPT2_bit          _BIT_ACCESS(ADRPT,2)
// ADRPT<ADRPT3>
extern volatile __bit                   ADRPT3              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 ADRPT3_bit          _BIT_ACCESS(ADRPT,3)
// ADRPT<ADRPT4>
extern volatile __bit                   ADRPT4              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 ADRPT4_bit          _BIT_ACCESS(ADRPT,4)
// ADRPT<ADRPT5>
extern volatile __bit                   ADRPT5              __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 ADRPT5_bit          _BIT_ACCESS(ADRPT,5)
// ADRPT<ADRPT6>
extern volatile __bit                   ADRPT6              __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 ADRPT6_bit          _BIT_ACCESS(ADRPT,6)
// ADRPT<ADRPT7>
extern volatile __bit                   ADRPT7              __at(0x4D7);	// @ (0x9A * 8 + 7)
#define                                 ADRPT7_bit          _BIT_ACCESS(ADRPT,7)
// ADCON3<ADSOI>
extern volatile __bit                   ADSOI               __at(0x8A3);	// @ (0x114 * 8 + 3)
#define                                 ADSOI_bit           _BIT_ACCESS(ADCON3,3)
// ADSTAT<ADSTAT0>
extern volatile __bit                   ADSTAT0             __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 ADSTAT0_bit         _BIT_ACCESS(ADSTAT,0)
// ADSTAT<ADSTAT1>
extern volatile __bit                   ADSTAT1             __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 ADSTAT1_bit         _BIT_ACCESS(ADSTAT,1)
// ADSTAT<ADSTAT2>
extern volatile __bit                   ADSTAT2             __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 ADSTAT2_bit         _BIT_ACCESS(ADSTAT,2)
// ADSTPTL<ADSTPT0>
extern volatile __bit                   ADSTPT0             __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 ADSTPT0_bit         _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<ADSTPT1>
extern volatile __bit                   ADSTPT1             __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 ADSTPT1_bit         _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<ADSTPT10>
extern volatile __bit                   ADSTPT10            __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 ADSTPT10_bit        _BIT_ACCESS(ADSTPTH,2)
// ADSTPTH<ADSTPT11>
extern volatile __bit                   ADSTPT11            __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 ADSTPT11_bit        _BIT_ACCESS(ADSTPTH,3)
// ADSTPTH<ADSTPT12>
extern volatile __bit                   ADSTPT12            __at(0x49C);	// @ (0x93 * 8 + 4)
#define                                 ADSTPT12_bit        _BIT_ACCESS(ADSTPTH,4)
// ADSTPTH<ADSTPT13>
extern volatile __bit                   ADSTPT13            __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 ADSTPT13_bit        _BIT_ACCESS(ADSTPTH,5)
// ADSTPTH<ADSTPT14>
extern volatile __bit                   ADSTPT14            __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 ADSTPT14_bit        _BIT_ACCESS(ADSTPTH,6)
// ADSTPTH<ADSTPT15>
extern volatile __bit                   ADSTPT15            __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 ADSTPT15_bit        _BIT_ACCESS(ADSTPTH,7)
// ADSTPTL<ADSTPT2>
extern volatile __bit                   ADSTPT2             __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 ADSTPT2_bit         _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<ADSTPT3>
extern volatile __bit                   ADSTPT3             __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 ADSTPT3_bit         _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<ADSTPT4>
extern volatile __bit                   ADSTPT4             __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 ADSTPT4_bit         _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<ADSTPT5>
extern volatile __bit                   ADSTPT5             __at(0x495);	// @ (0x92 * 8 + 5)
#define                                 ADSTPT5_bit         _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<ADSTPT6>
extern volatile __bit                   ADSTPT6             __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 ADSTPT6_bit         _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<ADSTPT7>
extern volatile __bit                   ADSTPT7             __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 ADSTPT7_bit         _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<ADSTPT8>
extern volatile __bit                   ADSTPT8             __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 ADSTPT8_bit         _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<ADSTPT9>
extern volatile __bit                   ADSTPT9             __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 ADSTPT9_bit         _BIT_ACCESS(ADSTPTH,1)
// PIE1<ADTIE>
extern volatile __bit                   ADTIE               __at(0x38B9);	// @ (0x717 * 8 + 1)
#define                                 ADTIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<ADTIF>
extern volatile __bit                   ADTIF               __at(0x3869);	// @ (0x70D * 8 + 1)
#define                                 ADTIF_bit           _BIT_ACCESS(PIR1,1)
// ADCON3<ADTMD0>
extern volatile __bit                   ADTMD0              __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 ADTMD0_bit          _BIT_ACCESS(ADCON3,0)
// ADCON3<ADTMD1>
extern volatile __bit                   ADTMD1              __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 ADTMD1_bit          _BIT_ACCESS(ADCON3,1)
// ADCON3<ADTMD2>
extern volatile __bit                   ADTMD2              __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 ADTMD2_bit          _BIT_ACCESS(ADCON3,2)
// ADUTHL<ADUTH0>
extern volatile __bit                   ADUTH0              __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 ADUTH0_bit          _BIT_ACCESS(ADUTHL,0)
// ADUTHL<ADUTH1>
extern volatile __bit                   ADUTH1              __at(0x471);	// @ (0x8E * 8 + 1)
#define                                 ADUTH1_bit          _BIT_ACCESS(ADUTHL,1)
// ADUTHH<ADUTH10>
extern volatile __bit                   ADUTH10             __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 ADUTH10_bit         _BIT_ACCESS(ADUTHH,2)
// ADUTHH<ADUTH11>
extern volatile __bit                   ADUTH11             __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 ADUTH11_bit         _BIT_ACCESS(ADUTHH,3)
// ADUTHH<ADUTH12>
extern volatile __bit                   ADUTH12             __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 ADUTH12_bit         _BIT_ACCESS(ADUTHH,4)
// ADUTHH<ADUTH13>
extern volatile __bit                   ADUTH13             __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 ADUTH13_bit         _BIT_ACCESS(ADUTHH,5)
// ADUTHH<ADUTH14>
extern volatile __bit                   ADUTH14             __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 ADUTH14_bit         _BIT_ACCESS(ADUTHH,6)
// ADUTHH<ADUTH15>
extern volatile __bit                   ADUTH15             __at(0x47F);	// @ (0x8F * 8 + 7)
#define                                 ADUTH15_bit         _BIT_ACCESS(ADUTHH,7)
// ADUTHL<ADUTH2>
extern volatile __bit                   ADUTH2              __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 ADUTH2_bit          _BIT_ACCESS(ADUTHL,2)
// ADUTHL<ADUTH3>
extern volatile __bit                   ADUTH3              __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 ADUTH3_bit          _BIT_ACCESS(ADUTHL,3)
// ADUTHL<ADUTH4>
extern volatile __bit                   ADUTH4              __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 ADUTH4_bit          _BIT_ACCESS(ADUTHL,4)
// ADUTHL<ADUTH5>
extern volatile __bit                   ADUTH5              __at(0x475);	// @ (0x8E * 8 + 5)
#define                                 ADUTH5_bit          _BIT_ACCESS(ADUTHL,5)
// ADUTHL<ADUTH6>
extern volatile __bit                   ADUTH6              __at(0x476);	// @ (0x8E * 8 + 6)
#define                                 ADUTH6_bit          _BIT_ACCESS(ADUTHL,6)
// ADUTHL<ADUTH7>
extern volatile __bit                   ADUTH7              __at(0x477);	// @ (0x8E * 8 + 7)
#define                                 ADUTH7_bit          _BIT_ACCESS(ADUTHL,7)
// ADUTHH<ADUTH8>
extern volatile __bit                   ADUTH8              __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 ADUTH8_bit          _BIT_ACCESS(ADUTHH,0)
// ADUTHH<ADUTH9>
extern volatile __bit                   ADUTH9              __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 ADUTH9_bit          _BIT_ACCESS(ADUTHH,1)
// ADSTAT<ADUTHR>
extern volatile __bit                   ADUTHR              __at(0x8AE);	// @ (0x115 * 8 + 6)
#define                                 ADUTHR_bit          _BIT_ACCESS(ADSTAT,6)
// SSP1CON3<AHEN>
extern volatile __bit                   AHEN                __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 AHEN_bit            _BIT_ACCESS(SSP1CON3,1)
// ALRMCON<ALRMEN>
extern volatile __bit                   ALRMEN              __at(0x6077);	// @ (0xC0E * 8 + 7)
#define                                 ALRMEN_bit          _BIT_ACCESS(ALRMCON,7)
// ALRMDAY<ALRMHDAY0>
extern volatile __bit                   ALRMHDAY0           __at(0x60CC);	// @ (0xC19 * 8 + 4)
#define                                 ALRMHDAY0_bit       _BIT_ACCESS(ALRMDAY,4)
// ALRMDAY<ALRMHDAY1>
extern volatile __bit                   ALRMHDAY1           __at(0x60CD);	// @ (0xC19 * 8 + 5)
#define                                 ALRMHDAY1_bit       _BIT_ACCESS(ALRMDAY,5)
// ALRMHR<ALRMHHR0>
extern volatile __bit                   ALRMHHR0            __at(0x60D4);	// @ (0xC1A * 8 + 4)
#define                                 ALRMHHR0_bit        _BIT_ACCESS(ALRMHR,4)
// ALRMHR<ALRMHHR1>
extern volatile __bit                   ALRMHHR1            __at(0x60D5);	// @ (0xC1A * 8 + 5)
#define                                 ALRMHHR1_bit        _BIT_ACCESS(ALRMHR,5)
// ALRMMIN<ALRMHMIN0>
extern volatile __bit                   ALRMHMIN0           __at(0x60DC);	// @ (0xC1B * 8 + 4)
#define                                 ALRMHMIN0_bit       _BIT_ACCESS(ALRMMIN,4)
// ALRMMIN<ALRMHMIN1>
extern volatile __bit                   ALRMHMIN1           __at(0x60DD);	// @ (0xC1B * 8 + 5)
#define                                 ALRMHMIN1_bit       _BIT_ACCESS(ALRMMIN,5)
// ALRMMIN<ALRMHMIN2>
extern volatile __bit                   ALRMHMIN2           __at(0x60DE);	// @ (0xC1B * 8 + 6)
#define                                 ALRMHMIN2_bit       _BIT_ACCESS(ALRMMIN,6)
// ALRMMTH<ALRMHMONTH>
extern volatile __bit                   ALRMHMONTH          __at(0x60BC);	// @ (0xC17 * 8 + 4)
#define                                 ALRMHMONTH_bit      _BIT_ACCESS(ALRMMTH,4)
// ALRMSEC<ALRMHSEC0>
extern volatile __bit                   ALRMHSEC0           __at(0x60E4);	// @ (0xC1C * 8 + 4)
#define                                 ALRMHSEC0_bit       _BIT_ACCESS(ALRMSEC,4)
// ALRMSEC<ALRMHSEC1>
extern volatile __bit                   ALRMHSEC1           __at(0x60E5);	// @ (0xC1C * 8 + 5)
#define                                 ALRMHSEC1_bit       _BIT_ACCESS(ALRMSEC,5)
// ALRMSEC<ALRMHSEC2>
extern volatile __bit                   ALRMHSEC2           __at(0x60E6);	// @ (0xC1C * 8 + 6)
#define                                 ALRMHSEC2_bit       _BIT_ACCESS(ALRMSEC,6)
// ALRMDAY<ALRMLDAY0>
extern volatile __bit                   ALRMLDAY0           __at(0x60C8);	// @ (0xC19 * 8 + 0)
#define                                 ALRMLDAY0_bit       _BIT_ACCESS(ALRMDAY,0)
// ALRMDAY<ALRMLDAY1>
extern volatile __bit                   ALRMLDAY1           __at(0x60C9);	// @ (0xC19 * 8 + 1)
#define                                 ALRMLDAY1_bit       _BIT_ACCESS(ALRMDAY,1)
// ALRMDAY<ALRMLDAY2>
extern volatile __bit                   ALRMLDAY2           __at(0x60CA);	// @ (0xC19 * 8 + 2)
#define                                 ALRMLDAY2_bit       _BIT_ACCESS(ALRMDAY,2)
// ALRMDAY<ALRMLDAY3>
extern volatile __bit                   ALRMLDAY3           __at(0x60CB);	// @ (0xC19 * 8 + 3)
#define                                 ALRMLDAY3_bit       _BIT_ACCESS(ALRMDAY,3)
// ALRMHR<ALRMLHR0>
extern volatile __bit                   ALRMLHR0            __at(0x60D0);	// @ (0xC1A * 8 + 0)
#define                                 ALRMLHR0_bit        _BIT_ACCESS(ALRMHR,0)
// ALRMHR<ALRMLHR1>
extern volatile __bit                   ALRMLHR1            __at(0x60D1);	// @ (0xC1A * 8 + 1)
#define                                 ALRMLHR1_bit        _BIT_ACCESS(ALRMHR,1)
// ALRMHR<ALRMLHR2>
extern volatile __bit                   ALRMLHR2            __at(0x60D2);	// @ (0xC1A * 8 + 2)
#define                                 ALRMLHR2_bit        _BIT_ACCESS(ALRMHR,2)
// ALRMHR<ALRMLHR3>
extern volatile __bit                   ALRMLHR3            __at(0x60D3);	// @ (0xC1A * 8 + 3)
#define                                 ALRMLHR3_bit        _BIT_ACCESS(ALRMHR,3)
// ALRMMIN<ALRMLMIN0>
extern volatile __bit                   ALRMLMIN0           __at(0x60D8);	// @ (0xC1B * 8 + 0)
#define                                 ALRMLMIN0_bit       _BIT_ACCESS(ALRMMIN,0)
// ALRMMIN<ALRMLMIN1>
extern volatile __bit                   ALRMLMIN1           __at(0x60D9);	// @ (0xC1B * 8 + 1)
#define                                 ALRMLMIN1_bit       _BIT_ACCESS(ALRMMIN,1)
// ALRMMIN<ALRMLMIN2>
extern volatile __bit                   ALRMLMIN2           __at(0x60DA);	// @ (0xC1B * 8 + 2)
#define                                 ALRMLMIN2_bit       _BIT_ACCESS(ALRMMIN,2)
// ALRMMIN<ALRMLMIN3>
extern volatile __bit                   ALRMLMIN3           __at(0x60DB);	// @ (0xC1B * 8 + 3)
#define                                 ALRMLMIN3_bit       _BIT_ACCESS(ALRMMIN,3)
// ALRMMTH<ALRMLMONTH0>
extern volatile __bit                   ALRMLMONTH0         __at(0x60B8);	// @ (0xC17 * 8 + 0)
#define                                 ALRMLMONTH0_bit     _BIT_ACCESS(ALRMMTH,0)
// ALRMMTH<ALRMLMONTH1>
extern volatile __bit                   ALRMLMONTH1         __at(0x60B9);	// @ (0xC17 * 8 + 1)
#define                                 ALRMLMONTH1_bit     _BIT_ACCESS(ALRMMTH,1)
// ALRMMTH<ALRMLMONTH2>
extern volatile __bit                   ALRMLMONTH2         __at(0x60BA);	// @ (0xC17 * 8 + 2)
#define                                 ALRMLMONTH2_bit     _BIT_ACCESS(ALRMMTH,2)
// ALRMMTH<ALRMLMONTH3>
extern volatile __bit                   ALRMLMONTH3         __at(0x60BB);	// @ (0xC17 * 8 + 3)
#define                                 ALRMLMONTH3_bit     _BIT_ACCESS(ALRMMTH,3)
// ALRMSEC<ALRMLSEC0>
extern volatile __bit                   ALRMLSEC0           __at(0x60E0);	// @ (0xC1C * 8 + 0)
#define                                 ALRMLSEC0_bit       _BIT_ACCESS(ALRMSEC,0)
// ALRMSEC<ALRMLSEC1>
extern volatile __bit                   ALRMLSEC1           __at(0x60E1);	// @ (0xC1C * 8 + 1)
#define                                 ALRMLSEC1_bit       _BIT_ACCESS(ALRMSEC,1)
// ALRMSEC<ALRMLSEC2>
extern volatile __bit                   ALRMLSEC2           __at(0x60E2);	// @ (0xC1C * 8 + 2)
#define                                 ALRMLSEC2_bit       _BIT_ACCESS(ALRMSEC,2)
// ALRMSEC<ALRMLSEC3>
extern volatile __bit                   ALRMLSEC3           __at(0x60E3);	// @ (0xC1C * 8 + 3)
#define                                 ALRMLSEC3_bit       _BIT_ACCESS(ALRMSEC,3)
// ALRMWD<ALRMLWDAY0>
extern volatile __bit                   ALRMLWDAY0          __at(0x60C0);	// @ (0xC18 * 8 + 0)
#define                                 ALRMLWDAY0_bit      _BIT_ACCESS(ALRMWD,0)
// ALRMWD<ALRMLWDAY1>
extern volatile __bit                   ALRMLWDAY1          __at(0x60C1);	// @ (0xC18 * 8 + 1)
#define                                 ALRMLWDAY1_bit      _BIT_ACCESS(ALRMWD,1)
// ALRMWD<ALRMLWDAY2>
extern volatile __bit                   ALRMLWDAY2          __at(0x60C2);	// @ (0xC18 * 8 + 2)
#define                                 ALRMLWDAY2_bit      _BIT_ACCESS(ALRMWD,2)
// ALRMCON<AMASK0>
extern volatile __bit                   AMASK0              __at(0x6072);	// @ (0xC0E * 8 + 2)
#define                                 AMASK0_bit          _BIT_ACCESS(ALRMCON,2)
// ALRMCON<AMASK1>
extern volatile __bit                   AMASK1              __at(0x6073);	// @ (0xC0E * 8 + 3)
#define                                 AMASK1_bit          _BIT_ACCESS(ALRMCON,3)
// ALRMCON<AMASK2>
